//encoding windows 1251 !!!
//Функция получения расчетного сопротивления по марке стали из СП 16.13330
function FuncGetRy
	(	
		NormDoc, //Код нормативного документа 
		//СП 16.13330.2017 с изменением 3 - "SP16.13330.2017i3"
		SteelMark, //Марка стали
		t //толщина в метрах
	)
{
	t = t*1000; //Перевод из м в мм
	var Wsh = new ActiveXObject("Wscript.shell");
	//Выбор по СП 16.13330.2017 с изм. 3
	if (NormDoc == "SP16.13330.2017i3")
	{
		if 	(
				SteelMark == "C245" ||
				SteelMark == "C255" ||
				SteelMark == "C345K" ||
				SteelMark == "C355" ||
				SteelMark == "C355-1" ||
				SteelMark == "C355K" ||
				SteelMark == "C355П" || //Пока непонятно как эту сталь задавать через плагин
				SteelMark == "C390" ||
				SteelMark == "C390-1" ||
				SteelMark == "C440" ||
				SteelMark == "C550" ||
				SteelMark == "C590" 
			)
		{
			if (SteelMark == "C245")
			{
				if (t<2 || t>20)
				{
					Wsh.Popup ("Для марки стали " + SteelMark + " прокат толщиной " + t + " мм не предусмотрен табл. В.3 СП 16.13330.2017 с изм.3.");
				}
				if (t>=2 && t<=20) {return 240*1000000;}

			}
			if (SteelMark == "C255")
			{
				if (t<2 || t>40)
				{
					Wsh.Popup ("Для марки стали " + SteelMark + " прокат толщиной " + t + " мм не предусмотрен табл. В.3 СП 16.13330.2017 с изм.3.");
				}
				if (t>=2 && t<4) {return 250*1000000;}
				if (t>4 && t<=10) {return 240*1000000;}
				if (t>10 && t<=20) {return 240*1000000;}
				if (t>20 && t<=40) {return 230*1000000;}
			}
			if (SteelMark == "C345K")
			{
				if (t<2 || t>10)
				{
					Wsh.Popup ("Для марки стали " + SteelMark + " прокат толщиной " + t + " мм не предусмотрен табл. В.3 СП 16.13330.2017 с изм.3.");
				}
				if (t>=2 && t<=10) {return 350*1000000;}
			}
			if (SteelMark == "C355")
			{
				if (t<2 || t>360)
				{
					Wsh.Popup ("Для марки стали " + SteelMark + " прокат толщиной " + t + " мм не предусмотрен табл. В.3 СП 16.13330.2017 с изм.3.");
				}
				if (t>=2 && t<=16) {return 350*1000000;}
				if (t>16 && t<=40) {return 340*1000000;}
				if (t>40 && t<=60) {return 330*1000000}
				if (t>60 && t<=80) {return 320*1000000}
				if (t>80 && t<=100) {return 310*1000000}
				if (t>100 && t<=160) {return 285*1000000}
				if (t>160 && t<=200) {return 280*1000000}
				if (t>200 && t<=260) {return 265*1000000}
				if (t>260 && t<=300) {return 255*1000000}
				if (t>300 && t<=360) {return 240*1000000}
			}
			if (SteelMark == "C355-1" || SteelMark == "C355K")
			{
				if (t<2 || t>50)
				{
					Wsh.Popup ("Для марки стали " + SteelMark + " прокат толщиной " + t + " мм не предусмотрен табл. В.3 СП 16.13330.2017 с изм.3.");
				}
				if (t>=2 && t<=16) {return 350*1000000;}
				if (t>16 && t<=40) {return 340*1000000;}
				if (t>40 && t<=60) {return 330*1000000}
				if (t>60 && t<=80) {return 320*1000000}
				if (t>80 && t<=100) {return 310*1000000}
				if (t>100 && t<=160) {return 285*1000000}
				if (t>160 && t<=200) {return 280*1000000}
				if (t>200 && t<=260) {return 265*1000000}
				if (t>260 && t<=300) {return 255*1000000}
				if (t>300 && t<=360) {return 240*1000000}
			}
			if (SteelMark == "C355П")
			{
				if (t<2 || t>40)
				{
					Wsh.Popup ("Для марки стали " + SteelMark + " прокат толщиной " + t + " мм не предусмотрен табл. В.3 СП 16.13330.2017 с изм.3.");
				}
				if (t>=2 && t<=16) {return 350*1000000;}
				if (t>16 && t<=40) {return 340*1000000;}
			}
			if (SteelMark == "C390" || SteelMark == "C390-1")
			{
				if (t<5 || t>160)
				{
					Wsh.Popup ("Для марки стали " + SteelMark + " прокат толщиной " + t + " мм не предусмотрен табл. В.3 СП 16.13330.2017 с изм.3.");
				}
				if (t>=5 && t<=16) {return 380*1000000;}
				if (t>16 && t<=40) {return 380*1000000;}
				if (t>40 && t<=60) {return 375*1000000;}
				if (t>60 && t<=80) {return 365*1000000;}
				if (t>80 && t<=100) {return 355*1000000;}
				if (t>100 && t<=160) {return 350*1000000;}
			}
			if (SteelMark == "C440")
			{
				if (t<5 || t>160)
				{
					Wsh.Popup ("Для марки стали " + SteelMark + " прокат толщиной " + t + " мм не предусмотрен табл. В.3 СП 16.13330.2017 с изм.3.");
				}
				if (t>=5 && t<=16) {return 430*1000000;}
				if (t>16 && t<=40) {return 430*1000000;}
				if (t>40 && t<=60) {return 430*1000000;}
				if (t>60 && t<=80) {return 415*1000000;}
				if (t>80 && t<=100) {return 405*1000000;}
				if (t>100 && t<=160) {return 395*1000000;}
			}
			if (SteelMark == "C550")
			{
				if (t<8 || t>50)
				{
					Wsh.Popup ("Для марки стали " + SteelMark + " прокат толщиной " + t + " мм не предусмотрен табл. В.3 СП 16.13330.2017 с изм.3.");
				}
				if (t>=8 && t<=50) {return 525*1000000;}
			}
			if (SteelMark == "C590")
			{
				if (t<8 || t>50)
				{
					Wsh.Popup ("Для марки стали " + SteelMark + " прокат толщиной " + t + " мм не предусмотрен табл. В.3 СП 16.13330.2017 с изм.3.");
				}
				if (t>=8 && t<=50) {return 575*1000000;}
			}
		}
		else
		{
			Wsh.Popup ("Работа с маркой стали " + SteelMark + " не предусмотрена!" + "\n" + "\n" + 
					"Замените марку стали или используйте при создании групп конструктивных элементов расчетное сопротивление",
					0, "Функция FuncSteelMarkToRy", 0);

		}
	}
}